templates/projects/flavorite.html
{{define "content"}}
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-22 su 22:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Flavorite</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tiitus Järvinen" />
</head>
<body>
<div id="content">
<h1 class="title">Flavorite</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdb80eb3">1. About</a>
<ul>
<li><a href="#org637bf36">1.1. Languages</a></li>
</ul>
</li>
<li><a href="#orgf1e2b9b">2. Installation</a>
<ul>
<li><a href="#org7db9075">2.1. Android</a>
<ul>
<li><a href="#org17d0f3c">2.1.1. Google Play Store</a></li>
<li><a href="#org631c13b">2.1.2. APK Installation</a></li>
</ul>
</li>
<li><a href="#orgc9a9287">2.2. Linux</a></li>
<li><a href="#org8793b8c">2.3. Windows</a></li>
<li><a href="#org4431b48">2.4. iOS/MacOS</a></li>
</ul>
</li>
<li><a href="#org3e095ec">3. Usage</a></li>
<li><a href="#org6b8c38d">4. Screenshots</a></li>
<li><a href="#orgbc1bde3">5. Building from source</a>
<ul>
<li><a href="#orgd2294d7">5.1. Source JSON Formatting</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb80eb3" class="outline-2">
<h2 id="orgdb80eb3"><span class="section-number-2">1</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
Flavorite is a cross-platform application that displays flavors that go well together in the majority of dishes. The app contains recommendations for (almost) every flavor in existence.
</p>
</div>

<div id="outline-container-org637bf36" class="outline-3">
<h3 id="org637bf36"><span class="section-number-3">1.1</span> Languages</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Currently, the application supports only english, and this will likely not change, as the translation process would take a long time.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf1e2b9b" class="outline-2">
<h2 id="orgf1e2b9b"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7db9075" class="outline-3">
<h3 id="org7db9075"><span class="section-number-3">2.1</span> Android</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There are two types of Android releases:
</p>
</div>

<div id="outline-container-org17d0f3c" class="outline-4">
<h4 id="org17d0f3c"><span class="section-number-4">2.1.1</span> <a href="https://play.google.com/store/apps/details?id=com.tipej.FlavorApp">Google Play Store</a></h4>
</div>
<div id="outline-container-org631c13b" class="outline-4">
<h4 id="org631c13b"><span class="section-number-4">2.1.2</span> APK Installation</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>Go to the <a href="https://github.com/tipeJ/FlavorApp/releases">Github releases page.</a></li>
<li>Download the APK package for your device architecture from the latest release.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgc9a9287" class="outline-3">
<h3 id="orgc9a9287"><span class="section-number-3">2.2</span> Linux</h3>
<div class="outline-text-3" id="text-2-2">
<p>
An <a href="https://www.appimage.org">AppImage</a> build is available on the <a href="https://www.github.com/tipej/flavorapp/releases/">releases page</a>.
</p>
</div>
</div>

<div id="outline-container-org8793b8c" class="outline-3">
<h3 id="org8793b8c"><span class="section-number-3">2.3</span> Windows</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Not yet available
</p>
</div>
</div>

<div id="outline-container-org4431b48" class="outline-3">
<h3 id="org4431b48"><span class="section-number-3">2.4</span> iOS/MacOS</h3>
<div class="outline-text-3" id="text-2-4">
<p>
While flutter supports both iOS and MacOS, this application will most likely not be available for either platform any time soon, as I lack both Apple hardware and the will to run MacOS in a VM.
</p>
</div>
</div>
</div>

<div id="outline-container-org3e095ec" class="outline-2">
<h2 id="org3e095ec"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Install the software</li>
<li>Search and list of flavors for the one you need, either by scrolling or using the search bar.</li>
<li>The flavor details screen will display the most recommended flavor at the top of the list, leaving the less common (but still useful) recommendations at the bottom. You can change this sorting to alphabetical.</li>
</ol>

<p>
You can flag the flavor as favourite by clicking the bookmark icon at the top of the details page, which adds the flavor to the favourites list, which can be accessed via the bottom navigation bar.
</p>
</div>
</div>
